#### Terraform Initialization ⚙️ - `success`
#### Terraform Validate 📃 - `success`
#### Terraform Plan 📖 - `success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/AIGISUK/gh-actions-terraform-hcloud-k3s/runs/run-EGj1am6K1465iv3b

Waiting for the plan to start...

Terraform v1.2.5
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.hcloud_k3s.hcloud_firewall.k3s will be created
  + resource "hcloud_firewall" "k3s" {
      + id     = (known after apply)
      + labels = (known after apply)
      + name   = "k3s-cluster"

      + rule {
          + destination_ips = [
              + "0.0.0.0/0",
            ]
          + direction       = "out"
          + protocol        = "icmp"
          + source_ips      = []
        }
      + rule {
          + destination_ips = [
              + "0.0.0.0/0",
            ]
          + direction       = "out"
          + port            = "123"
          + protocol        = "udp"
          + source_ips      = []
        }
      + rule {
          + destination_ips = [
              + "0.0.0.0/0",
            ]
          + direction       = "out"
          + port            = "443"
          + protocol        = "tcp"
          + source_ips      = []
        }
      + rule {
          + destination_ips = [
              + "0.0.0.0/0",
            ]
          + direction       = "out"
          + port            = "53"
          + protocol        = "tcp"
          + source_ips      = []
        }
      + rule {
          + destination_ips = [
              + "0.0.0.0/0",
            ]
          + direction       = "out"
          + port            = "53"
          + protocol        = "udp"
          + source_ips      = []
        }
      + rule {
          + destination_ips = [
              + "0.0.0.0/0",
            ]
          + direction       = "out"
          + port            = "80"
          + protocol        = "tcp"
          + source_ips      = []
        }
      + rule {
          + destination_ips = []
          + direction       = "in"
          + protocol        = "icmp"
          + source_ips      = [
              + "10.0.0.0/8",
              + "127.0.0.1/32",
              + "169.254.169.254/32",
              + "213.239.246.1/32",
            ]
        }
      + rule {
          + destination_ips = []
          + direction       = "in"
          + port            = "22"
          + protocol        = "tcp"
          + source_ips      = [
              + "0.0.0.0/0",
            ]
        }
      + rule {
          + destination_ips = []
          + direction       = "in"
          + port            = "6443"
          + protocol        = "tcp"
          + source_ips      = [
              + "10.0.0.0/8",
              + "127.0.0.1/32",
            ]
        }
      + rule {
          + destination_ips = []
          + direction       = "in"
          + port            = "any"
          + protocol        = "tcp"
          + source_ips      = [
              + "10.0.0.0/8",
              + "127.0.0.1/32",
              + "169.254.169.254/32",
              + "213.239.246.1/32",
            ]
        }
      + rule {
          + destination_ips = []
          + direction       = "in"
          + port            = "any"
          + protocol        = "udp"
          + source_ips      = [
              + "10.0.0.0/8",
              + "127.0.0.1/32",
              + "169.254.169.254/32",
              + "213.239.246.1/32",
            ]
        }
    }

  # module.hcloud_k3s.hcloud_load_balancer.k3s_api_lb will be created
  + resource "hcloud_load_balancer" "k3s_api_lb" {
      + delete_protection  = false
      + id                 = (known after apply)
      + ipv4               = (known after apply)
      + ipv6               = (known after apply)
      + labels             = {
          + "provisioner" = "terraform"
        }
      + load_balancer_type = "lb11"
      + location           = "nbg1"
      + name               = "k3s-api-lb"
      + network_id         = (known after apply)
      + network_ip         = (known after apply)
      + network_zone       = (known after apply)

      + algorithm {
          + type = "least_connections"
        }

      + target {
          + server_id      = (known after apply)
          + type           = (known after apply)
          + use_private_ip = (known after apply)
        }
    }

  # module.hcloud_k3s.hcloud_load_balancer_network.k3s_network will be created
  + resource "hcloud_load_balancer_network" "k3s_network" {
      + enable_public_interface = true
      + id                      = (known after apply)
      + ip                      = (known after apply)
      + load_balancer_id        = (known after apply)
      + subnet_id               = (known after apply)
    }

  # module.hcloud_k3s.hcloud_load_balancer_service.k3s_api_service will be created
  + resource "hcloud_load_balancer_service" "k3s_api_service" {
      + destination_port = 6443
      + id               = (known after apply)
      + listen_port      = 6443
      + load_balancer_id = (known after apply)
      + protocol         = "tcp"
      + proxyprotocol    = (known after apply)

      + health_check {
          + interval = (known after apply)
          + port     = (known after apply)
          + protocol = (known after apply)
          + retries  = (known after apply)
          + timeout  = (known after apply)

          + http {
              + domain       = (known after apply)
              + path         = (known after apply)
              + response     = (known after apply)
              + status_codes = (known after apply)
              + tls          = (known after apply)
            }
        }

      + http {
          + certificates    = (known after apply)
          + cookie_lifetime = (known after apply)
          + cookie_name     = (known after apply)
          + redirect_http   = (known after apply)
          + sticky_sessions = (known after apply)
        }
    }

  # module.hcloud_k3s.hcloud_load_balancer_target.k3s_api_lb_target will be created
  + resource "hcloud_load_balancer_target" "k3s_api_lb_target" {
      + id               = (known after apply)
      + label_selector   = "type=server"
      + load_balancer_id = (known after apply)
      + type             = "label_selector"
      + use_private_ip   = true
    }

  # module.hcloud_k3s.hcloud_network.k3s_net will be created
  + resource "hcloud_network" "k3s_net" {
      + delete_protection = false
      + id                = (known after apply)
      + ip_range          = "10.0.0.0/8"
      + labels            = {
          + "type" = "cluster"
        }
      + name              = "k3s-net-01"
    }

  # module.hcloud_k3s.hcloud_network_subnet.k3s_net will be created
  + resource "hcloud_network_subnet" "k3s_net" {
      + gateway      = (known after apply)
      + id           = (known after apply)
      + ip_range     = "10.1.0.0/16"
      + network_id   = (known after apply)
      + network_zone = "eu-central"
      + type         = "cloud"
    }

  # module.hcloud_k3s.hcloud_placement_group.k3s_agent_placement_group[0] will be created
  + resource "hcloud_placement_group" "k3s_agent_placement_group" {
      + id      = (known after apply)
      + name    = "k3s-agent-group-1"
      + servers = (known after apply)
      + type    = "spread"
    }

  # module.hcloud_k3s.hcloud_placement_group.k3s_server_placement_group[0] will be created
  + resource "hcloud_placement_group" "k3s_server_placement_group" {
      + id      = (known after apply)
      + name    = "k3s-server-group-1"
      + servers = (known after apply)
      + type    = "spread"
    }

  # module.hcloud_k3s.hcloud_server.agent_node["0-0-micro"] will be created
  + resource "hcloud_server" "agent_node" {
      + allow_deprecated_images    = false
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = (known after apply)
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "ubuntu-22.04"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "engine"      = "k3s"
          + "provisioner" = "terraform"
          + "type"        = "agent"
        }
      + location                   = "hel1"
      + name                       = (known after apply)
      + placement_group_id         = (known after apply)
      + rebuild_protection         = false
      + server_type                = "cx11"
      + ssh_keys                   = [
          + "default",
        ]
      + status                     = (known after apply)
      + user_data                  = (known after apply)

      + network {
          + alias_ips   = []
          + ip          = (known after apply)
          + mac_address = (known after apply)
          + network_id  = (known after apply)
        }
    }

  # module.hcloud_k3s.hcloud_server.server_node[0] will be created
  + resource "hcloud_server" "server_node" {
      + allow_deprecated_images    = false
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = (known after apply)
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "ubuntu-22.04"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "engine"      = "k3s"
          + "provisioner" = "terraform"
          + "type"        = "server"
        }
      + location                   = "nbg1"
      + name                       = (known after apply)
      + placement_group_id         = (known after apply)
      + rebuild_protection         = false
      + server_type                = "cx11"
      + ssh_keys                   = [
          + "default",
        ]
      + status                     = (known after apply)
      + user_data                  = (known after apply)

      + network {
          + alias_ips   = []
          + ip          = (known after apply)
          + mac_address = (known after apply)
          + network_id  = (known after apply)
        }
    }

  # module.hcloud_k3s.hcloud_server.server_node[1] will be created
  + resource "hcloud_server" "server_node" {
      + allow_deprecated_images    = false
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = (known after apply)
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "ubuntu-22.04"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "engine"      = "k3s"
          + "provisioner" = "terraform"
          + "type"        = "server"
        }
      + location                   = "nbg1"
      + name                       = (known after apply)
      + placement_group_id         = (known after apply)
      + rebuild_protection         = false
      + server_type                = "cx11"
      + ssh_keys                   = [
          + "default",
        ]
      + status                     = (known after apply)
      + user_data                  = (known after apply)

      + network {
          + alias_ips   = []
          + ip          = (known after apply)
          + mac_address = (known after apply)
          + network_id  = (known after apply)
        }
    }

  # module.hcloud_k3s.hcloud_server.server_node_init[0] will be created
  + resource "hcloud_server" "server_node_init" {
      + allow_deprecated_images    = false
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = (known after apply)
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "ubuntu-22.04"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "engine"      = "k3s"
          + "provisioner" = "terraform"
          + "type"        = "server"
        }
      + location                   = "nbg1"
      + name                       = (known after apply)
      + placement_group_id         = (known after apply)
      + rebuild_protection         = false
      + server_type                = "cx11"
      + ssh_keys                   = [
          + "default",
        ]
      + status                     = (known after apply)
      + user_data                  = (sensitive)

      + network {
          + alias_ips   = []
          + ip          = "10.1.0.2"
          + mac_address = (known after apply)
          + network_id  = (known after apply)
        }
    }

  # module.hcloud_k3s.hcloud_ssh_key.default will be created
  + resource "hcloud_ssh_key" "default" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + name        = "default"
      + public_key  = <<-EOT
            ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIJNcwP5mhs5/F2T9GFHmg4z6E6sbOG+Ynx2iPERKeOGm
        EOT
    }

  # module.hcloud_k3s.random_id.agent_node_id[0] will be created
  + resource "random_id" "agent_node_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.hcloud_k3s.random_id.server_node_id[0] will be created
  + resource "random_id" "server_node_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.hcloud_k3s.random_id.server_node_id[1] will be created
  + resource "random_id" "server_node_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.hcloud_k3s.random_id.server_node_id[2] will be created
  + resource "random_id" "server_node_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.hcloud_k3s.random_password.k3s_agent_token will be created
  + resource "random_password" "k3s_agent_token" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 48
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = false
    }

  # module.hcloud_k3s.random_password.k3s_token will be created
  + resource "random_password" "k3s_token" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 48
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = false
    }

  # module.hcloud_k3s.tls_cert_request.client_admin_user will be created
  + resource "tls_cert_request" "client_admin_user" {
      + cert_request_pem = (known after apply)
      + id               = (known after apply)
      + key_algorithm    = (known after apply)
      + private_key_pem  = (sensitive value)

      + subject {
          + common_name  = "system:admin"
          + organization = "system:masters"
        }
    }

  # module.hcloud_k3s.tls_locally_signed_cert.client_admin_user will be created
  + resource "tls_locally_signed_cert" "client_admin_user" {
      + allowed_uses          = [
          + "key_encipherment",
          + "digital_signature",
          + "client_auth",
        ]
      + ca_cert_pem           = (known after apply)
      + ca_key_algorithm      = (known after apply)
      + ca_private_key_pem    = (sensitive value)
      + cert_pem              = (known after apply)
      + cert_request_pem      = (known after apply)
      + early_renewal_hours   = 0
      + id                    = (known after apply)
      + ready_for_renewal     = true
      + validity_end_time     = (known after apply)
      + validity_period_hours = 8760
      + validity_start_time   = (known after apply)
    }

  # module.hcloud_k3s.tls_private_key.keys["client"] will be created
  + resource "tls_private_key" "keys" {
      + algorithm                     = "ECDSA"
      + ecdsa_curve                   = "P256"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

  # module.hcloud_k3s.tls_private_key.keys["client-admin"] will be created
  + resource "tls_private_key" "keys" {
      + algorithm                     = "ECDSA"
      + ecdsa_curve                   = "P256"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

  # module.hcloud_k3s.tls_private_key.keys["request-header"] will be created
  + resource "tls_private_key" "keys" {
      + algorithm                     = "ECDSA"
      + ecdsa_curve                   = "P256"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

  # module.hcloud_k3s.tls_private_key.keys["server"] will be created
  + resource "tls_private_key" "keys" {
      + algorithm                     = "ECDSA"
      + ecdsa_curve                   = "P256"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

  # module.hcloud_k3s.tls_self_signed_cert.ca_certs["client"] will be created
  + resource "tls_self_signed_cert" "ca_certs" {
      + allowed_uses          = [
          + "cert_signing",
          + "key_encipherment",
          + "digital_signature",
        ]
      + cert_pem              = (known after apply)
      + early_renewal_hours   = 0
      + id                    = (known after apply)
      + is_ca_certificate     = true
      + key_algorithm         = (known after apply)
      + private_key_pem       = (sensitive value)
      + ready_for_renewal     = true
      + validity_end_time     = (known after apply)
      + validity_period_hours = 87600
      + validity_start_time   = (known after apply)

      + subject {
          + common_name = (known after apply)
        }
    }

  # module.hcloud_k3s.tls_self_signed_cert.ca_certs["request-header"] will be created
  + resource "tls_self_signed_cert" "ca_certs" {
      + allowed_uses          = [
          + "cert_signing",
          + "key_encipherment",
          + "digital_signature",
        ]
      + cert_pem              = (known after apply)
      + early_renewal_hours   = 0
      + id                    = (known after apply)
      + is_ca_certificate     = true
      + key_algorithm         = (known after apply)
      + private_key_pem       = (sensitive value)
      + ready_for_renewal     = true
      + validity_end_time     = (known after apply)
      + validity_period_hours = 87600
      + validity_start_time   = (known after apply)

      + subject {
          + common_name = (known after apply)
        }
    }

  # module.hcloud_k3s.tls_self_signed_cert.ca_certs["server"] will be created
  + resource "tls_self_signed_cert" "ca_certs" {
      + allowed_uses          = [
          + "cert_signing",
          + "key_encipherment",
          + "digital_signature",
        ]
      + cert_pem              = (known after apply)
      + early_renewal_hours   = 0
      + id                    = (known after apply)
      + is_ca_certificate     = true
      + key_algorithm         = (known after apply)
      + private_key_pem       = (sensitive value)
      + ready_for_renewal     = true
      + validity_end_time     = (known after apply)
      + validity_period_hours = 87600
      + validity_start_time   = (known after apply)

      + subject {
          + common_name = (known after apply)
        }
    }

Plan: 29 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + kubeconfig = (sensitive value)
```

</details>

*Pusher: @colinwilson, Action: `pull_request`, Workdir: `github_actions`, Workflow: `Terraform GitHub Actions`*